#!/usr/bin/env bash

curl -X POST -H 'Content-type:application/json' -d '{"kw":"fuck"}' localhost:9100/api/kw/match


#curl -X POST -H 'Content-type:application/json' -d '{"kw":"判断方法fuck示例f**k代码我们先来说一下最没受争议的红色铭文，红色铭文分别为圣人、梦魇、凶.6%，梦魇是法术攻击+4.2、法穿穿透+2.4。考虑到通用性，凶兆铭文是可以毫不犹豫的舍弃掉的，剩下圣人VS梦魇铭文。圣人铭文带来的法术攻击加成虽高，但是在法师的装备中，法术加成的装备件件都是。而带穿透的装备却只有法穿鞋、法穿杖、 面具这3件，通常情况下一句最多也只会出一件，所以红色铭文选择梦魇的作用是高于圣人的"}' localhost:9100/api/kw/match

curl -X POST -H 'Content-type:application/json' -d '{"kw":"中共中央总书记、国家主席、中央军委主席、中央全面深化改革委员会主任习近平5月29日下午主持召开中央全面深化改革委员会第八次会议并发表重要讲话。他强调，当前，我国改革发展形势正处于深刻变化之中，外部不确定不稳定因素增多，改革发展面临许多新情况新问题。我们要保持战略定力，坚持问题导向，因势利导、统筹谋划、精准施策，在防范化解重大矛盾和突出问题上出实招硬招，推动改革更好服务经济社会发展大局会议指出，创新和完善宏观调控，加快建立同高质量发展要求相适应、体现新发展理念的宏观调控目标体系、政策体系、决策协调体系、监督考评体系、保障体系，要坚持稳中求进工作总基调，坚持以供给侧结构性改革为主线，突出统筹兼顾、综合平衡，注重处理好政府和市场、短期和长期、国内和国际的关系，统筹稳增长、促改革、调结构、惠民生、防风险、保稳定，发挥国家发展规划的战略导向作用，健全财政、货币、就业、产业、区域等经济政策协调机制，保持经济运行在合理区间"}' vulne01.tianji.bjzt.360es.cn:9105/api/dlp/kw

curl -X POST  -F "filename=@阿里强化学习实践.pdf" localhost:9100/api/dlp/file

curl -X POST -H 'Content-type:application/json' -d '{"kw":"一天早晨，格里高尔.萨姆沙从不安的睡梦中醒来，发现自己躺在床上变成了一只巨大的甲虫，fuck！"}' 10.95.22.66:1080/api/dlp/kw

curl -X POST -H 'Content-type:application/json' -d '{"kw":"我整个灵魂都充满了奇妙的欢快，犹如我以整个心身欣赏的甜美的春晨，因为对面那个小姐jie/小女且姐/小*姐*姐实在太美了"}' 10.95.22.66:1080/api/dlp/fuzzy

